app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categories = Category::all();
---
select * from `categories`

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'description' => 'nullable|string',
        ]);

        Category::create($request->all());
---
insert into `categories` (`name`, `description`, `updated_at`, `created_at`) values ('Sohan Ahmed', 'dfghjkj', '2024-08-13 04:23:18', '2024-08-13 04:23:18')

    public function update(Request $request, Category $category)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'description' => 'nullable|string',
        ]);

        $category->update($request->all());
---
update `categories` set `description` = 'dfghjkj cuyfvugyik', `categories`.`updated_at` = '2024-08-13 04:24:25' where `id` = 5

    public function destroy(Category $category)
    {
        $category->delete();
---
delete from `categories` where `id` = 1